Revit 2027 API
BuiltInFailures.MechanicalFailures.PanelValidateConfigurationError Property
 More than one circuit falls onto the same slot. Disconnect the circuits from the panel?
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId PanelValidateConfigurationError { get; }
Public Shared ReadOnly Property PanelValidateConfigurationError As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ PanelValidateConfigurationError {
	FailureDefinitionId^ get ();
}
static member PanelValidateConfigurationError : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.MechanicalFailures Class
Autodesk.Revit.DB Namespace